app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)

    if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "city", "state", "country", "created_at", "updated_at", "team_id", "project_id", "team_name", "project_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def index
    if params.has_key?(:team_id)
      @members = Member.where(team_id: params[:team_id])
    elsif params.has_key?(:project_id)
      @members = Member.where(project_id: params[:project_id])
    else
      @members = Member.all
---
SELECT "members".* FROM "members" WHERE "members"."team_id" = $1 LIMIT $2  [["team_id", 1], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."project_id" = $1  [["project_id", 2]]
SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
      @member = Member.find(params[:id])

      if @member.update(member_params)
---
SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "first_name" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["first_name", "\"JJ\""], ["updated_at", "2022-03-10 19:19:17.865631"], ["id", 1]]