app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at", "team_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "WatchPro"], ["created_at", "2022-03-10 21:16:39.488131"], ["updated_at", "2022-03-10 21:16:39.488131"], ["team_id", nil]]
---
  def create
    @project = Project.new(project_params)

    if @project.save