app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Pacman"], ["created_at", "2022-03-10 20:44:33.412698"], ["updated_at", "2022-03-10 20:44:33.412698"]]
---
  def create
    @team = Team.new(team_params)

    if @team.save

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @team = Team.find_by(id: params[:id])